app/Http/Controllers/API/AuthAPIController.php

    public function login(Request $request)
    {
        $request->validate([
            'email' => 'required|email',
            'password' => 'required',
            'location.latitude' => 'nullable|numeric',
            'location.longitude' => 'nullable|numeric',
            'device_info.device_id' => 'required|string',
            'device_info.device_name' => 'nullable|string',
            'device_info.os' => 'nullable|string',
            'device_info.app_version' => 'nullable|string',
        ]);

        $user = User::where('email', $request->email)->first();

        if (! $user || ! Hash::check($request->password, $user->password)) {
            return response()->json(['message' => 'Invalid credentials'], 401);
        }

        // Log device info
        $user->deviceLogs()->create([
            'device_id' => $request->device_info['device_id'],
            'device_name' => $request->device_info['device_name'] ?? null,
            'os' => $request->device_info['os'] ?? null,
            'app_version' => $request->device_info['app_version'] ?? null,
            'latitude' => $request->location['latitude'] ?? null,
            'longitude' => $request->location['longitude'] ?? null,
        ]);
---
select * from `users` where `email` = 'admin@supremeprotection.com' and `users`.`deleted_at` is null limit 1
insert into `device_logs` (`device_id`, `device_name`, `os`, `app_version`, `latitude`, `longitude`, `user_id`, `updated_at`, `created_at`) values ('abc123', 'Yousif\'s Phone', 'Android', '1.0.0', 31.5, 34.4, 2, '2025-07-22 06:46:56', '2025-07-22 06:46:56')

        return response()->json([
            'access_token' => $accessToken,
            'refresh_token' => $refreshToken,
            'user' => [
                'id' => $user->id,
                'email' => $user->email,
                'name' => $user->first_name . ' ' . $user->last_name,
                'role' => $user->getRoleNames()->first(),
                'profile' => $user->profile // make sure profile relation is defined
            ],
---
select * from `profiles` where `profiles`.`user_id` = 2 and `profiles`.`user_id` is not null limit 1

    public function forgotPassword(Request $request)
    {
        $request->validate(['email' => 'required|email']);

        $user = User::where('email', $request->email)->first();
        if (! $user) {
            return response()->json(['message' => 'If your email exists, a reset code has been sent.'], 200);
        }

        $code = rand(100000, 999999);
        Cache::put('reset_code_' . $request->email, $code, now()->addMinutes(15));

        DB::table('password_resets')->updateOrInsert(
            ['email' => $user->email],
            ['code' => $code, 'created_at' => Carbon::now()]
        );
---
select * from `users` where `email` = 'admin@supremeprotection.com' and `users`.`deleted_at` is null limit 1
update `password_resets` set `code` = 994946, `created_at` = '2025-07-22 07:10:21' where (`email` = 'admin@supremeprotection.com') limit 1

    public function verifyResetCode(Request $request)
    {
        $request->validate([
            'email' => 'required|email',
            'code' => 'required|string'
        ]);

        $cachedCode = DB::table('password_resets')->where('email', $request->email)->value('code');
---
select `code` from `password_resets` where `email` = 'admin@supremeprotection.com' limit 1

    public function resetPassword(Request $request)
    {
        $request->validate([
            'email' => 'required|email',
            'reset_token' => 'required|string',
            'new_password' => 'required|string|min:6',
        ]);

        $cachedToken = Cache::get('reset_token_' . $request->email);

        if (!$cachedToken || $cachedToken !== $request->reset_token) {
            return response()->json([
                'message' => 'Invalid or expired reset token'
            ], 422);
        }

        $user = User::where('email', $request->email)->first();

        if (!$user) {
            return response()->json([
                'message' => 'User not found'
            ], 404);
        }

        Log::info('Before saving user password reset: ' . $user->id);
        $user->password = bcrypt($request->new_password);
        $user->save();
        Log::info('After saving user password reset');

        Cache::forget('reset_token_' . $request->email);
        DB::table('password_resets')->where('email', $request->email)->delete();
---
select * from `users` where `email` = 'admin@supremeprotection.com' and `users`.`deleted_at` is null limit 1
update `users` set `password` = '$2y$12$6GyFmC7ni0AvoTz2JmgDt.6SnSHEPDRKRsR/Z/o9uS0y4FcmoJE/2', `users`.`updated_at` = '2025-07-22 07:33:55' where `id` = 2
delete from `password_resets` where `email` = 'admin@supremeprotection.com'

    public function refreshToken(Request $request)
    {
        $request->validate([
            'refresh_token' => 'required|string',
        ]);

        // Use the token string to find the user ID
        $userId = Cache::get('refresh_token_' . $request->refresh_token);

        if (! $userId) {
            return response()->json(['message' => 'Invalid refresh token'], 401);
        }

        $user = User::find($userId);
---
select * from `users` where `users`.`id` = 2 and `users`.`deleted_at` is null limit 1