app/Http/Controllers/API/ProfileAPIController.php

    public function getProfile(Request $request)
    {
        $user = $request->user()->load(['profile.bankDetail', 'profile.emergencyContact']);
---
select * from `bank_details` where `bank_details`.`profile_id` in (1)
select * from `emergency_contacts` where `emergency_contacts`.`profile_id` in (1)
select * from `profiles` where `profiles`.`user_id` in (2)

    public function updateProfile(Request $request)
    {
        $request->validate([
            'email' => 'nullable|email',
            'first_name' => 'nullable|string',
            'last_name' => 'nullable|string',
            'phone' => 'nullable|string',
            'address' => 'nullable|string',
            'emergency_contact.name' => 'nullable|string',
            'emergency_contact.phone' => 'nullable|string',
            'emergency_contact.relationship' => 'nullable|string',
            'bank_details.account_name' => 'nullable|string',
            'bank_details.account_number' => 'nullable|string',
            'bank_details.sort_code' => 'nullable|string',
            'bank_details.bank_name' => 'nullable|string',
        ]);

        $profile = $request->user()->profile;

        // Ensure a profile record exists for this user (API clients may hit update before getProfile)
        if (! $profile) {
            $profile = $request->user()->profile()->create([
                'first_name' => $request->user()->first_name ?? '',
                'last_name' => $request->user()->last_name ?? '',
                'phone' => '',
                'address' => '',
                'emergency_contact' => [],
                'bank_details' => [],
                'face_data' => null,
            ]);
---
select * from `profiles` where `profiles`.`user_id` = 2 and `profiles`.`user_id` is not null limit 1
select * from `emergency_contacts` where `emergency_contacts`.`profile_id` = 1 and `emergency_contacts`.`profile_id` is not null limit 1
select * from `bank_details` where `bank_details`.`profile_id` = 1 and `bank_details`.`profile_id` is not null limit 1


            // Ensure fillable is set in Profile model; save other profile fields as requested
            $profile->fill($request->only(['first_name', 'last_name', 'phone', 'address']));
            $profile->save();
---
update `profiles` set `face_data` = '[\"faces\\/687f4207acae4.jpg\",\"faces\\/687f4208e8626.jpg\",\"faces\\/687f4208e8cee.jpg\"]', `profiles`.`updated_at` = '2025-07-22 07:47:20' where `profiles`.`user_id` = 2 and `profiles`.`user_id` is not null