app/Http/Controllers/API/ProfileAPIController.php

        $bank = $profile->bankDetail ?: new BankDetails();
        $bank->fill($request->input('bank_details', []));
        $bank->profile_id = $profile->id;
        $bank->save();
---
insert into `bank_details` (`profile_id`, `updated_at`, `created_at`) values (1, '2025-07-22 07:46:29', '2025-07-22 07:46:29')