app/Traits/LogsChanges.php

            $fields = rtrim($fields, ', ');
            $labels = rtrim($labels, ',<br> ');

            $model->logs()->create([
                'user_name' => optional(Auth::user())->first_name ?? 'System' . ' ' . optional(Auth::user())->last_name ?? 'System',
                'action' => "Updated {$fields}",
                'description' => $labels,
            ]);
        });

        static::created(function ($model) {
            $modelType = class_basename($model); // e.g., "Client" or "Site"

            // Try to get a name field, or fallback to ID
            $label = $model->client_name ?? $model->site_name ?? $model->fore_name ?? $model->shift->fore_name ?? $model->company_name ?? $model->first_name ?? $model->name ?? $model->id;

            // create shift logs description
            if ($modelType == 'ShiftDate') {
                $modelType = 'Shift';
                $staff = isset($model->staff->first_name) ? $model->staff?->first_name . ' ' . $model->staff?->last_name : 'N/A';
                $site = $model->shift->site->site_name ?? 'N/A';
                $date = $model->shift_date ?? 'N/A';
                $start = $model->start_time ?? 'N/A';
                $end = $model->end_time ?? 'N/A';

                // $label = "for the Staff ($staff) on site ($site) on $date from $start to $end";
                $label = '';
            }

            if (auth::user()) {
                $username = Auth::user()->first_name . ' ' . Auth::user()->last_name;
---
insert into `logs` (`user_name`, `action`, `description`, `loggable_id`, `loggable_type`, `updated_at`, `created_at`) values (' ', 'Updated password', 'Updated <br>password from \'$2y$12$88F5O2k4f9pw7xYMmAezau05OL/IXvYXGhW.2.fEcRpNLDDezSux. to \'$2y$12$6GyFmC7ni0AvoTz2JmgDt.6SnSHEPDRKRsR/Z/o9uS0y4FcmoJE/2', 2, 'App\\Models\\User', '2025-07-22 07:33:55', '2025-07-22 07:33:55')
select * from `sites` where `sites`.`id` = 1074 and `sites`.`deleted_at` is null limit 1
select * from `shifts` where `shifts`.`id` = 15 limit 1

                $username = 'System';
            }

            $model->logs()->create([
                'user_name' => $username,
                'action' => "Created {$modelType} record",
                'description' => "{$modelType} {$label} was added successfully.",
            ]);
---
insert into `logs` (`user_name`, `action`, `description`, `loggable_id`, `loggable_type`, `updated_at`, `created_at`) values ('Super Admin', 'Created Shift record', 'Shift  was added successfully.', 31, 'App\\Models\\ShiftDate', '2025-07-22 08:48:46', '2025-07-22 08:48:46')