app/Http/Controllers/ShiftController.php

insert into `shifts` (`client_id`, `site_id`, `company_id`, `staff_id`, `start_shift`, `end_shift`, `break-mins_shift`, `number_shift`, `site_rate`, `service_type_1`, `service_type_2`, `subcontractor_id`, `from_shift`, `to_shift`, `comments`, `days`, `employee_rate`, `start`, `end`, `po_number`, `lost_time`, `po_rate`, `manager_1_id`, `manager_2_id`, `restrict_start_time`, `enforce_picture_check`, `restrict_location_check`, `updated_at`, `created_at`) values ('9', '1074', null, null, '11:00', '15:00', null, null, null, null, null, null, '2025-07-22', '2025-07-23', null, '[\"Mon,Tue,Wed,Thu,Fri,Sat,Sun\"]', null, null, null, null, null, null, null, null, 0, 0, 0, '2025-07-22 08:48:45', '2025-07-22 08:48:45')
---
            ]);


            $validator->after(function ($validator) use ($request, $i, &$shiftsWorkingHours, $documents) {
                $start = $request->start_shift[$i] ?? null;
                $end = $request->end_shift[$i] ?? null;
                $from = $request->from_shift[$i] ?? null;
                $to = $request->to_shift[$i] ?? null;
                $breakMinutes = $request->{'break-mins_shift'}[$i] ?? null;
                $dayString = $request->days[$i] ?? 'Mon,Tue,Wed,Thu,Fri,Sat,Sun';

                // ✅ Validate time logic only if both times are present and correctly formatted
                if ($start && $end && preg_match('/^\d{2}:\d{2}$/', $start) && preg_match('/^\d{2}:\d{2}$/', $end)) {
                    $startTime = \Carbon\Carbon::createFromFormat('H:i', $start);
                    $endTime = \Carbon\Carbon::createFromFormat('H:i', $end);

                    if ($startTime->eq($endTime)) {
                        $validator->errors()->add("end_shift", "End time must not be the same as start time.");
                    } else {
                        // Calculate duration in minutes (handling overnight shifts)
                        $duration = $endTime->diffInMinutes($startTime, false);

                        if ($duration <= 0) {
                            // If negative or zero, assume next day

select * from `shifts` where `shifts`.`id` in (13)
---
                        $shiftStart = Carbon::parse($date->format('Y-m-d') . ' ' . $data['start_shift']);
                        $shiftEnd   = Carbon::parse($date->format('Y-m-d') . ' ' . $data['end_shift']);

                        $leave = LeaveRequest::where('user_id', $data['staff_id'])
                            ->where('status', 'approved')
                            ->where(function ($query) use ($shiftStart, $shiftEnd) {
                                $query->where(function ($q) use ($shiftStart, $shiftEnd) {
                                    $q->where('start_date', '<=', $shiftEnd)
                                        ->where('end_date', '>=', $shiftStart);
                                });
                            })
                            ->first();