app/Http/Controllers/ShiftController.php

    public function scheduling()
    {
        $shifts = Shift::all();
        $clients = Client::all();
        $sites = Site::all();
        $staffs = Employee::all();
        $subcontractors = Subcontractor::all();
        $users = User::all();
        $services = EmployeeType::all();
---
select * from `clients` where `clients`.`deleted_at` is null
select * from `sites` where `sites`.`deleted_at` is null
select * from `employees` where `employees`.`deleted_at` is null
select * from `sub_contractors` where `sub_contractors`.`deleted_at` is null
select * from `employee_types`

    public function worker_calendar()
    {
        $shifts = Shift::all();
        $clients = Client::all();
        $sites = Site::all();
        $staffs = Employee::all();
        $subcontractors = Subcontractor::all();
        $users = User::all();
        $services = EmployeeType::all();
---
select * from `shifts`
select * from `clients` where `clients`.`deleted_at` is null
select * from `sites` where `sites`.`deleted_at` is null
select * from `employees` where `employees`.`deleted_at` is null
select * from `sub_contractors` where `sub_contractors`.`deleted_at` is null
select * from `users` where `users`.`deleted_at` is null
select * from `employee_types`

    public function site_calendar()
    {
        $shifts = Shift::all();
        $clients = Client::all();
        $sites = Site::all();
        $staffs = Employee::all();
        $subcontractors = Subcontractor::all();
        $users = User::all();
        $services = EmployeeType::all();
---
select * from `shifts`
select * from `clients` where `clients`.`deleted_at` is null
select * from `sites` where `sites`.`deleted_at` is null
select * from `employees` where `employees`.`deleted_at` is null
select * from `sub_contractors` where `sub_contractors`.`deleted_at` is null
select * from `users` where `users`.`deleted_at` is null
select * from `employee_types`

    public function today_rota()
    {
        $shifts = Shift::all();
        $clients = Client::all();
        $sites = Site::all();
        $staffs = Employee::all();
        $subcontractors = Subcontractor::all();
        $users = User::all();
        $services = EmployeeType::all();
---
select * from `shifts`
select * from `clients` where `clients`.`deleted_at` is null
select * from `sites` where `sites`.`deleted_at` is null
select * from `employees` where `employees`.`deleted_at` is null
select * from `sub_contractors` where `sub_contractors`.`deleted_at` is null
select * from `users` where `users`.`deleted_at` is null
select * from `employee_types`

    public function getShiftsBySite()
    {
        $shifts = Shift::with(['site'])->get();
---
select * from `shifts` where `shifts`.`id` in (13, 15)
select * from `sites` where `sites`.`id` in (1074) and `sites`.`deleted_at` is null

    public function getTodayShifts()
    {
        $today = now()->format('Y-m-d');

        $shifts = Shift::with(['client', 'site'])
            ->whereDate('from_shift', '<=', $today)
            ->whereDate('to_shift', '>=', $today)
            ->get();
---
select * from `clients` where `clients`.`id` in (2, 9) and `clients`.`deleted_at` is null
select * from `sites` where `sites`.`id` in (1074) and `sites`.`deleted_at` is null

    public function assign(Request $request)
    {
        $request->validate([
            'shift_id' => 'required|exists:shift_dates,id',
            'staff_id' => 'required|exists:employees,id',
        ]);

        $shift = ShiftDate::findOrFail($request->shift_id);
        $staff = \App\Models\Employee::findOrFail($request->staff_id);

        // 1. ✅ Check if staff has an overlapping shift at this time
        $overlap = \App\Models\ShiftDate::where('staff_id', $staff->id)
            ->where('shift_date', $shift->shift_date)
            ->where(function ($query) use ($shift) {
                $query->where(function ($q) use ($shift) {
                    $q->where('start_time', '<', $shift->end_time)
                        ->where('end_time', '>', $shift->start_time);
                });
            })
            ->exists();
---
select * from `shifts`