app/Http/Controllers/UserController.php

select * from `shift_dates` where `shift_date` = '2025-07-22' and `shift_dates`.`deleted_at` is null
select * from `shifts` where `shifts`.`id` in (13)
select * from `invoices` where `invoices`.`deleted_at` is null
select count(*) as aggregate from `shift_dates` where `is_assign` = '1' and `created_at` between '2025-07-21 00:00:00' and '2025-07-27 23:59:59' and `shift_dates`.`deleted_at` is null
select * from `clients` where `clients`.`deleted_at` is null
select count(*) as aggregate from `employees` where `created_at` between '2025-07-14 00:00:00' and '2025-07-20 23:59:59' and `employees`.`deleted_at` is null
---
    public function dashboard()
{
        $shifts = ShiftDate::where('shift_date', Carbon::today()->toDateString())->with('shift.staff')->get();
        $invoices = Invoice::all();
        $review = ShiftDate::where('is_assign', '1')->count();
        $clients = Client::all();
        $staffs = User::role('security_staff')->get();

        $checkCalls = CheckCall::whereIn('status', ['pending', 'missed', 'completed'])
            ->orderBy('scheduled_time', 'desc')
            ->limit(20)  // limit to recent 10 or whatever you want
            ->get();

        $now = Carbon::now();
        $bookings = ShiftBooking::orderBy('timestamp')->get();

        $today = Carbon::today();

        $siaDocuments = Employee::whereNotNull('sia_licence')
            ->whereDate('sia_expiry', '<', Carbon::today()->toDateString())
            ->select('fore_name', 'sur_name', 'sia_expiry', 'sia_licence_file')
            ->paginate(5);

select * from `users` where `users`.`id` = '84' and `users`.`deleted_at` is null limit 1
---
        ->whereIn('id', function ($query) {
            $query->select(DB::raw('MAX(id)'))
                ->from('locations')
                ->whereNotNull('user_id')
                ->groupBy('user_id');
        })
        ->get()
        ->map(function ($l) {
            return [
                'id' => $l->id,
                'user_id' => $l->user_id,
                'latitude' => (float) $l->latitude,
                'longitude' => (float) $l->longitude,
                'accuracy' => $l->accuracy,
                'on_duty' => (bool) $l->on_duty,
                'timestamp' => optional($l->created_at)->toDateTimeString(),
                'user' => [
                    'id' => optional($l->user)->id,
                    'first_name' => optional($l->user)->first_name ?? 'Unknown',
                    'last_name' => optional($l->user)->last_name ?? '',
                ],
                'service_type_id' => optional(optional($l->user)->employee)->service_type,
            ];
        });